rp3595686/ultifeeder_esp32/src/main.cpp
void sendPUTRequest(uint16_t index)
{
  static bool requestOpenResult;

  reqCount[index]--;
  readySend[index] = false;

  requestOpenResult = request[index].open("PUT", addreses[index][reqCount[index]]);

  if (requestOpenResult)
  {
    // Only send() if open() returns true, or crash
    Serial.print("\nSending request: ");
    request[index].send(strSendJson);
  }
  else
  {
    Serial.print("\nCan't send bad request : ");
  }

  Serial.println(addreses[index][reqCount[index]]);
}

void sendRequest0()
{
  sendPOSTRequest(0);
}

void sendRequest1()
{
  sendPOSTRequest(1);
}

void sendRequest2()
{
  sendGETRequest(2);
}

void sendRequest3()
{
  sendPUTRequest(3);
}

void sendRequest4()
{
  sendPOSTRequest(4);
}

void sendRequests()
{
  // Setting all requests to have only 1 site
  /*for (int index = 0; index < NUM_DIFFERENT_SITES; index++)
  {
    reqCount[index] = 1;
  }*/

  reqCount[0] = NUM_ENTRIES_SITE_0;
  reqCount[1] = NUM_ENTRIES_SITE_1;
  reqCount[2] = NUM_ENTRIES_SITE_2;
  reqCount[3] = NUM_ENTRIES_SITE_3;
  reqCount[4] = NUM_ENTRIES_SITE_4;
}

void requestCB0(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
  (void)optParm;

  if (readyState == readyStateDone)
  {
    AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
    AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

    if (thisRequest->responseHTTPcode() == 200)
    {
      Serial.println(F("\n**************************************"));
      Serial.println(thisRequest->responseText());
      Serial.println(F("**************************************"));
    }

    thisRequest->setDebug(false);
    readySend[0] = true;
  }
}

void requestCB1(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
  (void)optParm;

  if (readyState == readyStateDone)
  {
    AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
    AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

    if (thisRequest->responseHTTPcode() == 200)
    {
      Serial.println(F("\n**************************************"));
      Serial.println(thisRequest->responseText());
      Serial.println(F("**************************************"));
    }

    thisRequest->setDebug(false);
    readySend[1] = true;
  }
}

void requestCB2(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
  (void)optParm;

  if (readyState == readyStateDone)
  {
    AHTTPS_LOGDEBUG0(F("\n**************************************\n"));
    AHTTPS_LOGDEBUG1(F("Response Code = "), thisRequest->responseHTTPString());

    if (thisRequest->responseHTTPcode() == 200)
    {
      unsigned long pre_feedInterval, pre_readPhInterval, pre_readTempInterval; // save previous values
      String responseText = thisRequest->responseText();
      Serial.println(F("\n**************************************"));
      Serial.println(responseText);
      Serial.println(F("**************************************"));
      if (responseText == "null")
      {
        Serial.print("No config detected. Send local config to firebase.");
        noConfigDetected = true;
      }
      else
      {
        StaticJsonDocument<192> jsonResponse;
        auto deserializeError = deserializeJson(jsonResponse, responseText);

        if (deserializeError)
        {
          Serial.println(F("failed"));
        }
        else
        {
          Serial.println(F("OK"));

          if (jsonResponse["readPhInterval"])
          {
            pre_readPhInterval = atoi(readPhInterval); // save previous feedInterval
            // sprintf(pre_readPhInterval, "%s", readPhInterval);
            int readPhInterval_buffer = jsonResponse["readPhInterval"];
            // readPhInterval_buffer = readPhInterval_buffer * 1000; // Change from seconds to miliseconds
            sprintf(readPhInterval, "%d", readPhInterval_buffer);
            // sprintf(millis_char,"%lu", millis_ulong);
            Serial.print("Set readPhInterval to ");
            Serial.println(readPhInterval);
          }
          if (jsonResponse["readTempInterval"])
          {
            pre_readTempInterval = atoi(readTempInterval); // save previous feedInterval
            unsigned long readTempInterval_buffer = jsonResponse["readTempInterval"];
            // readTempInterval_buffer = readTempInterval_buffer * 1000; // Change from seconds to miliseconds
            sprintf(readTempInterval, "%d", readTempInterval_buffer);
            Serial.print("Set readTempInterval to ");
            Serial.println(readTempInterval);
          }
          if (jsonResponse["feedInterval"])
          {
            pre_feedInterval = atoi(feedInterval); // save previous feedInterval
            unsigned long feedInterval_buffer = jsonResponse["feedInterval"];
            // feedInterval_buffer = feedInterval_buffer * 1000; // Change from seconds to miliseconds
            sprintf(feedInterval, "%d", feedInterval_buffer);
            Serial.print("Set feedInterval to ");
            Serial.println(feedInterval);
          }
          if (atoi(readPhInterval) != pre_readPhInterval || atoi(readTempInterval) != pre_readTempInterval || atoi(feedInterval) != pre_feedInterval) // feedInterval changed
          {
            saveFileFSConfigFile(); // save new data to Config File
          }
          jsonResponse.clear(); // release memory used by JsonObject
        }
      }
    }

    thisRequest->setDebug(false);
    readySend[2] = true;

    if (noConfigDetected == true)
    {
      strSendJson = ""; // clear string
      sendJson.clear(); // release memory used by JsonObject
      sendJson["readPhInterval"] = readPhInterval;
      sendJson["readTempInterval"] = readTempInterval;
      sendJson["feedInterval"] = feedInterval;
      serializeJson(sendJson, strSendJson);
      if (readySend[3] && WiFi.status() == WL_CONNECTED) // ready to send and wifi connected
      {
        reqCount[3] = NUM_ENTRIES_SITE_3;
        sendRequestCB[3]();
        noConfigDetected = false;
      }
    }
  }
}

void requestCB3(void *optParm, AsyncHTTPSRequest *thisRequest, int readyState)
{
  (void)optParm;

