rp3595686/ultifeeder_esp32/src/main.cpp
  while (strTime == "Failed to obtain time" && timeNotObtained == false) // Try to obtain time from the NTP sever configured
  {
    configTime(gmtOffset_sec, daylightOffset_sec, ntpServers[ntpArrayIndex]);
    strTime = getTime();
    if (strTime == "Failed to obtain time")
    {
      Serial.print("Failed to obtain time from ");
      Serial.println(ntpServers[ntpArrayIndex]);
      ntpArrayIndex++;
    }
    if (ntpArrayIndex > ntpArraySize - 1)
    {
      Serial.println("Failed to obtain time from all NTP Severs configured.");
      Serial.println("Data will not be sent to database.");
      timeNotObtained = true;
    }
  }
}

void loop()
{
  // Call the double reset detector loop method every so often,
  // so that it can recognise when the timeout expires.
  // You can also call drd.stop() when you wish to no longer
  // consider the next reset as a double reset.
  drd->loop();

  currentMillis = millis();

  if (currentMillis - readPh_startMillis >= atoi(readPhInterval))
  {
    readPh_startMillis = currentMillis;
    phValue = map(analogRead(PH_PIN), 0, 4096, 0, 14);
    // phValue = random(6,8); // random data for testing
    Serial.print("pH:");
    Serial.println(phValue, 4);
    showOnLcd();          // show ph on LCD
    strSendJson = "";     // clear string
    sendJson.clear();     // release memory used by JsonObject
    if (!timeNotObtained) // if able to configure NTP
    {
      sendJson["time"] = getTime();
      sendJson["value"] = phValue;
      serializeJson(sendJson, strSendJson);
      if (readySend[0]) // ready to send
      {
        reqCount[0] = NUM_ENTRIES_SITE_0;
        sendRequestCB[0]();
      }
    }
  }

  if (currentMillis - readTemp_startMillis >= atoi(readTempInterval))
  {
    readTemp_startMillis = currentMillis;
    // temperature = random(24,27);  // random data for testing
    temperature = readTemperature(); // read your temperature sensor
    Serial.print("Temperature:");
    Serial.print(temperature, 1);
    Serial.println("^C");
    showOnLcd();          // show temperature on LCD
    strSendJson = "";     // clear string
    sendJson.clear();     // release memory used by JsonObject
    if (!timeNotObtained) // if able to configure NTP
    {
      sendJson["time"] = getTime();         // store current time into json
      sendJson["value"] = temperature;      // store temperauture value into json
      serializeJson(sendJson, strSendJson); // transfer json into String for sending
      if (readySend[1])                     // ready to send
      {
        reqCount[1] = NUM_ENTRIES_SITE_1;
        sendRequestCB[1]();
      }
    }
  }

  if (currentMillis - fetchConfig_startMillis >= fetchConfigInterval)
  {
    fetchConfig_startMillis = currentMillis;
    if (readySend[2] && WiFi.status() == WL_CONNECTED) // ready to send and wifi connected
    {
      reqCount[2] = NUM_ENTRIES_SITE_2;
      sendRequestCB[2]();
    }
  }

  // Check food left
  isFoodLeft = digitalRead(topIRpin); // 1 = no food detected, 0 = food detected

  if (!isFoodLeft)
  { // food detected
    noFoodCount = 0;
  }
  if (currentMillis - noFoodDetect_startMillis >= noFoodDetectInterval)
  { // detect at 1 second interval
    if (isFoodLeft)
    {                // if no food left
      noFoodCount++; // start counter
    }
    noFoodDetect_startMillis = currentMillis;
  }
  if (noFoodCount >= 5)
  {                                    // more than 5 sec of no food detected
    Serial.println("No Food"); // Alert user

    // Send Error message to firebase (not working)
    /*strSendJson = "";                // clear string
    sendJson.clear();                  // release memory used by JsonObject
    if (!timeNotObtained)              // if able to configure NTP
    {
      sendJson["time"] = getTime();                // store current time into json
      sendJson["message"] = "No Food is detected"; // store temperauture value into json
      serializeJson(sendJson, strSendJson);        // transfer json into String for sending
      if (readySend[4])                            // ready to send
      {
        reqCount[4] = NUM_ENTRIES_SITE_4;
        sendRequestCB[4]();
      }
    }*/
    noFoodCount = 0; // reset counter
  }

  // Feed food
  if (currentMillis - foodFeed_startMillis >= atoi(feedInterval))
  {
    foodFeed_startMillis = currentMillis;
    foodStuckDetect_startMillis = currentMillis;
    motorTurning_startMillis = currentMillis;
    isFoodStuckDetectStart = true;
    isMotorTurning = true;
  }
  if (isMotorTurning)
  {
    Serial.println("Motor Turn!");

    if (currentMillis - motorTurning_startMillis <= motorTurnPeriod) // constantly turning for 5 second
    {
      digitalWrite(motor1pin2, LOW); // turn motor
    }
    else
    {
      digitalWrite(motor1pin2, HIGH);
      isMotorTurning = false;
    }
  }
  if (isFoodStuckDetectStart)
  {
    isFoodStuck = digitalRead(buttomIRpin); // 1 = stuck, 0 = not stuck
    if (isFoodStuck)
    {
      Serial.println("Food Stuck"); // Alert user

      // Send Error message to firebase (not working)
      /*strSendJson = "";                   // clear string
      sendJson.clear();                     // release memory used by JsonObject
      if (!timeNotObtained)                 // if able to configure NTP
      {
      sendJson["time"] = getTime();         // store current time into json
      sendJson["message"] = "Food stuck";   // store temperauture value into json
      serializeJson(sendJson, strSendJson); // transfer json into String for sending
      if (readySend[4])                     // ready to send
      {
        reqCount[4] = NUM_ENTRIES_SITE_4;
        sendRequestCB[4]();
      }
      }*/
      isFoodStuckDetectStart = false; // reset detection status
    }
    else
    {
      if (currentMillis - foodStuckDetect_startMillis <= foodStuckDetectPeriod)
      {                                         // constantly detecting for 5 second
        isFoodStuck = digitalRead(buttomIRpin); // 1 = stuck, 0 = not stuck
      }
      else
      {                                 // 5 sec passed
        isFoodStuckDetectStart = false; // reset detection status
      }
    }
  }
}